content-org/o.org
* Homepage Ideas
:PROPERTIES:
:EXPORT_FILE_NAME: homepage_ideas
:EXPORT_HUGO_SECTION: docs
:END:
** Personal notes about homepage
- /meta
  - backdoors
    - this is more for my framework of things/products than my homepage.
    - Have a backdoor for a banner across all your webpages, in case if you want to announce anything you just update it in once place and all your outlets that you have on the internet have that message
  - main map
    - map everything i have online(public/private) to one place(hops).
    - there can be a master image that'll always get updated.
    - also would love to have a proper diagram of the whole thing. suggest starting the diagram by their own section and as things mature we can work on the master diagram.
    - [[https://github.com/seanbreckenridge/HPI#readme][seanbreckenridge/HPI: Human Programming Interface]]
  - when i am gone:
    - [[https://thoughtscollected.tech/posts/for-when-im-gone/][Cheat Sheet For If I'm Gone]]
    - [[https://github.com/potatoqualitee/eol-dr][potatoqualitee/eol-dr: A crowd-sourced guide to help techs help]]
    - Have a public blog and a private blog(not the rant sitE), write extreme takes on the private blog. Have a secret key to it, write where to find it in the public and keep that unpublished. add a watchdog timer to publish the steps to get the key. i.e Once I die it'll automatically publish that.
    - [[https://github.com/wilrnh/emergencywalletcards.com][wilrnh/emergencywalletcards.com]]
    - my manual (see below) should have pointers to when i am gone.
- /metahuman (please change name)
  - Make a 3D replica of exact me, a page where this is rendered in webgl
  - physical properties/abilities/kills/like game character, height, weight etc.
  - keep track of my daily running, and other activities.
  - [[https://github.com/brunosimon/my-room-in-3d][GitHub - brunosimon/my-room-in-3d]]
  - [[https://gyrosco.pe/aprilzero/helix/mind/][Anand Sharma on Gyroscope]]
  - [[https://acko.net/][Hackery, Math & Design — Acko.net]]
- /thoughts
  - a place where i can simply post any thought that comes to my mind without having to think "what will someone think?", i tried very hard to get rid of this insecurity but it's hard. So as long as it stays with me, i really need a way where i can just vent however wrong/bad/thoughtcrimey my thoughts are. If i need to correct myself, i need to put it out. My thoughts are NOT me, i need this separation, due to this fear of judgment i am not able to share my thoughts clearly.
  - It'll be nice to have hashtags/tags where i post these random daily thoughts. org-journal and org-capture would do a great job on my laptop, but i need some mechanism to do it from my phone. Lot of phones occur to me when i am away from my phone and sometimes i would not want to re-write it from my laptop. See [[https://github.com/knadh/tg-archive][tg-archive]]
- /interactions
  - have a section in your blog where people can ask you about your laptop setup. If i know the answer i'll simply answer it, if don't then you get the answer + some amount of bitcoin!
- /donations
  - need to have a donations page, donations to orgs and open source projects
- /photos
  - take photo, remind me to take a photo everyday.
- /food
  - personal food recipes
    - [[https://github.com/balevine/cocktails][balevine/cocktails: Cocktail Recipes]]
  - personal food preferences and places i like
- /list of list page
  - /tools
    - list tools(across different platforms, maybe separated by platform)
    - also describe how i make use of it/plan to make use of it.
    - [[https://steveblank.com/tools-and-blogs-for-entrepreneurs/][Steve Blank Startup Tools]]
    - [[https://web.archive.org/web/19970711071555/http://www.cooltool.com/apr96.html][cooltools]] + contab weekly combo
    - See "Installed Packages Info page generator" on projects.org
    - [[https://nikhilism.com/post/2020/mystery-knowledge-useful-tools/][Mystery Knowledge and Useful Tools - Nikhil's blog]]
  - /links
    - [[https://www.gwern.net/Links][About Gwern · Gwern.net]]
    - [[https://manassaloi.com/links/][Links | Manas J. Saloi]]
  - /tils
    - [[https://github.com/hodovani/hodovani.github.io][hodovani/hodovani.github.io: A collection of personal notes]]
- /dateme
  - a page that would probably help me find a wifu, why throw away chances
- /other_cool_things
  - nice to have a random video on my homepage (from my selected set)
  - if i am available, people can directly chat with me from the site (on voice, video and text)
  - [[https://github.com/GMartigny/gh.midi][GMartigny/gh.midi: 🎵 Create a MIDI file from your Github contributions.]]
  - archival
    - [[https://www.gwern.net/Archiving-URLs][Archiving URLs · Gwern.net]]
    - simply throw it reddit/instagram/twitter urls and it downloads the video on its own etc
    - [[https://beepb00p.xyz/promnesia.html][Promnesia | beepb00p]]
    - [[https://github.com/archivy/archivy][archivy/archivy: Archivy is a self-hostable knowledge]]
** Social Media
- [[https://news.ycombinator.com/item?id=27173728][Building a personal website in 2021 | Hacker News]]  : SM vs building your website
- [[https://github.com/matrix-org][matrix.org · GitHub]]
- [[https://fraidyc.at/][Fraidycat]]
- [[https://micro.blog/][Micro.blog]]
- [[https://anagora.org/index][{{index}} - anagora.org]]
- [[https://brid.gy/][Bridgy]]
- twitter
  - twitter list automation(backups, or maintain elsewhere), tweet deletion, other automation, backup etc
  - [[https://github.com/koenrh/delete-tweets][koenrh/delete-tweets: Delete tweets from your timeline.]]
  - [[https://github.com/medialab/gazouilloire][medialab/gazouilloire: Twitter stream + search API grabber]]
** Blogging
- Audience
  - Since I think writing is the best way i can express myself, i need a way for myself to get heard when i want to, therefore i need an audience.
  - Write slightly different version of the same blogpost initially to gain some traction. Eg. If you write original "How to install a linux", also write slightly abridged version called "How to install linux when you have windows installed" in a slightly different way and content at a different distribution platform like medium. This will not be required once you have significant traffic on your blog.
  - If you write regularly and write top quality content then you might as well become premium members in other blogging platforms
- Document and record the entire process of writing a blogpost from idea curation, generation, research and editing.
- Blog should have support for usual log articles and also custom designed page for special articles. See this [[https://www.tiger.exposed/project/lore][homepage for the idea]]
- Blog should have first class support for indieweb things
  - [[https://indieweb.org/][IndieWeb]]
  - [[https://indiewebify.me/][IndieWebify.Me - a guide to getting you on the IndieWeb]]
  - Examples: [[https://jamesvandyne.com/][James Van Dyne]]
- Full support for RSS
- i want to express things socially without being on social media[[https://gyrosco.pe/aprilzero/helix/mind/][Anand Sharma on Gyroscope]]
** Anonymous Blogging
- [[https://anonymousplanet-ng.org/guide.html][Full guide on online anonymity]]
- [[https://tdarb.org/blog-anonymously/index.html][Blogging as an anon]]
- [[https://k3tan.com/starting-a-new-digital-identity][Starting a new digital identity | k3tan.com]]
- [[https://github.com/CrowdStrike/travel-laptop][CrowdStrike/travel-laptop]]
- [[https://calyxos.org/get/][Get CalyxOS]] (explore other options such as libre, graphite etc)
** Inspiration
- setup
  - [[https://archive.is/KPct0][How to put yourself online]]
  - [[https://github.com/jkup/awesome-personal-blogs][jkup/awesome-personal-blogs]]
  - [[https://github.com/captn3m0][captn3m0 (Nemo)]] : really like how he has separate pages explaining their security and normal setup.
  - [[https://wiki.thingsandstuff.org/Main_Page][Things and Stuff Wiki]] love how applications and practices that they use are organized
- manual
  - [[https://mgree.github.io/][mgreenbe(1) - Michael Greenberg]] : make a geekodour cli, it's manpage should have this.
  - [[https://www.linkedin.com/pulse/i-wrote-user-manual-working-me-its-been-amazingly-zach-coelius/][Zach Coelius User Manual .95]]
- looks and organization
  - [[https://aegir.org/words/smoothbooze][Aegir.org | Smooth booze]] : Love it how he has different color schemes and layout based on the page and the handwritten signature on the bottom.
    - 75% width ftw.
    - i probably just want my blog to be like this
  - [[https://satyrs.eu/heraldry/][My coat of arms | Marijn’s site 🍇]] : Want something like this for my site/home but assamese
  - [[https://dreamcult.xyz/][dreamcult]]
  - 404 page should play, phone cannot be found ringtone.
  - [[https://y-n10.com/][Yamauchi No.10 Family Office]]  jsut wow, also music on toggle change. sound on/off
    - love the music [[https://maya.land/][welcome. | maya.land]]
  - [[https://joelhooks.com/][your friend Joel]] : love the site header and title
  - [[https://aengusmcmillin.com/brain][My Brain - Aengus McMillin]] : Like how he has a changelog for the blog
  - [[https://www.brendanschlagel.com/][Brendan Schlagel]] love the anti-library, canon, collaborate page, now,
  - [[https://aaronparecki.com/][Aaron Parecki]] : love the stats n who he is
  - [[https://slim.computer/][Slim Lim]]
  - [[https://www.gwern.net/Design][Design Of This Website · Gwern.net]]
  - [[https://github.com/ariroffe/personal-website][ariroffe/personal-website: Code for my Pokémon-style personal]]
  - [[https://andymatuschak.org/][Andy Matuschak]] : love the column layout
  - [[https://feross.org/][Home of Feross Aboukhadijeh » Feross.org]] : component organization and colors
  - [[https://github.com/muesli][muesli (Christian Muehlhaeuser) · GitHub]] : Love their github readme
  - [[https://github.com/abhisheknaiidu/awesome-github-profile-readme][abhisheknaiidu/awesome-github-profile-readme]]
  - [[https://omglord.com/maps][OMGLORD]] : Love the city maps idea and the way the homepage color changes
  - [[https://sean.fish/#][sean]] : idk what i like about this, maybe not a virus thing, just keeping cuz weird
  - [[https://www.kickscondor.com][Kicks Condor]] : i am straight but i would kiss this guy
    - [[https://maya.land/site-structure/][Site Structure | maya.land]]
    - [[https://notes.andymatuschak.org/Evergreen_notes][Evergreen notes]]
  - [[https://feltpresence.com/][Ryan Singer]] : love the minimal column formatting
  - [[https://wiki.xxiivv.com/site/home.html][XXIIVV — home]] : really like the use of icons and images, a little difficult to navigate
  - [[https://gordonbrander.com/lib][Bookshelf — Gordon Brander]] : like their library and pattern pages
- content
  - [[https://www.gwern.net/][Essays · Gwern.net]]  like the categorization
  - [[https://www.zylstra.org/blog/feeds/][Feeds – Interdependent Thoughts]]
  - [[https://brainbaking.com/post/2021/04/using-hugo-to-launch-a-gemini-capsule/][Using Hugo to Launch a Gemini Capsule | Brain Baking]]
  - [[https://zerokspot.com/blogroll/][zerokspot.com]] : blogroll, link to other ppls blogs
  - [[https://www.quartey.com/questions][Emmanuel Quartey | Writing]]
    - questions categorization
    - public goals diff link, this is similar to my roadmap plan
  - welcome to the anteroom
    - https://www.lileks.com/
  - [[https://hacdias.com/guestbook][Guestbook - Henrique Dias (hacdias)]]
    - guest book
    - [[https://hacdias.com/checkins][Checkins - Henrique Dias (hacdias)]]
    - [[https://hacdias.com/emojis][Emojis - Henrique Dias (hacdias)]]
    - [[https://hacdias.com/colophon][Colophon - Henrique Dias (hacdias)]]
    - website connected over tor
  - mention that my wiki are my working notes and not intended for publ use
  - learn with me page
  - [[https://webring.xxiivv.com/][Webring]]
  - https://sphygm.us/ love their notice on homepage, better now page
  - [[https://busterbenson.com/beliefs/][Buster Benson | Codex Vitae]] : codex is cool and [[https://busterbenson.com/the-life-of/buster/][life is also cool]]
  - [[http://danny.oz.au/privacy/][Privacy Statement: Danny Yee's websites]] : like the privacy policy and the map in the travelogue
  - https://julian.digital/activity/life-logging/
  - https://www.notion.so/matthewsiu/The-Library-149b0c670fc2463bb08c8c0de6e5018b
  - https://nintil.com/categories/links/
  - [[https://j3s.sh/thought/my-website-is-one-binary.html][jes post]] : like mY vAlUeS
  - [[https://pketh.org/how-i-build.html][How I Build]]
  - [[https://manfred.life/][Manfred Touron]] : love their sections and usage of graphic
  - [[https://www.datagubbe.se/][datagubbe.se]] : love their sections which are self written
  - [[https://webb.page/][The Webb Page]] : do not really like the webpage but like the webring idea
  - [[https://supermemo.guru/wiki/Piotr_Wozniak][Piotr Wozniak - supermemo.guru]] : like the honesty (also linked in SR)
- Project listing
  - [[https://thesephist.com/posts/tools/][Build tools around workflows, not workflows around tools | thesephist.com]]
  - [[https://thume.ca/][Tristan's Site - Tristan Hume]] : like how their presents his projects
  - [[https://ncase.me/][It's Nicky Case!]]
  - [[https://daniellebaskin.com/][Danielle Baskin]] : Love how this guy is presenting his work, what i want to do very closely relates to his work
  - [[https://joshpigford.com/projects][Projects - Josh Pigford]] : Again love how he's showing his work, similar vein of work.
  - [[https://nomadlist.com/open][Open Startup - Nomad List]]
  - [[https://simpleanalytics.com/open][Simple Analytics financial and customer happiness metrics]]
  - [[https://www.lkhrs.com/stats/][Stats - Luke's Wild Website]]
    - [[https://roytang.net/page/stats/site/][Stats :: Website · roytang.net]]
  - [[https://www.bannerbear.com/open/][Open Startup Metrics - Bannerbear]]
- Wiki ideas
  - Wikis
    - [[https://maggieappleton.com/garden-history][A Brief History & Ethos of the Digital Garden]]
    - [[https://publish.obsidian.md/swyx/README][README - swyx's second brain - Obsidian Publish]]
    - a very nice bi-directional wiki: [[https://barnsworthburning.net/][barnsworthburning]] love the terms(spaces)
** Monie 💸
- different fund me pages for different causes, be specific about why and how you plan to use the monie
- [[https://github.com/antfu-sponsors/hi][antfu-sponsors/hi: 👋🏼 About my Sponsor Program]]
- [[https://github.com/nayafia/microgrants][nayafia/microgrants: A list of microgrant programs for your good ideas]]
- [[https://github.com/mezod/awesome-indie][mezod/awesome-indie: Resources for independent developers to make money]]
- [[https://github.com/ralphtheninja/open-funding][ralphtheninja/open-funding: A guide for researching ways of funding]]
- [[https://github.com/nayafia/lemonade-stand][nayafia/lemonade-stand: A handy guide to financial support for oss]]
- [[https://github.com/beeware/paying-the-piper][beeware/paying-the-piper: A project for discussing ways to fund oss]]
- [[https://www.ogrants.org/grants-01-all.html][Grants (all) · Open Grants]]
- [[https://github.com/jamesmunns/yogslaw][jamesmunns/yogslaw: An idea regarding non-commercial open source lic]]
- [[https://justine.lol/redbean2/][redbean 2.0 release notes]] like the funding image
- gh sponsors
- Patreon if we create content
- buy me coffee
- just do good work and people will start noticing
- gumroad
- [[https://amazon.com/hz/wishlist/ls/EE78A23EEGQB][amazon wishlist Project tip jar]]
- https://ipaidthemost.com/ : have this into your page, and into your websites. replace ads with this.
