content/docs/homepage_ideas.md
+++
title = "Homepage Ideas"
author = ["Hrishikesh Barman"]
draft = false
+++

## Personal notes about homepage {#personal-notes-about-homepage}

-   /meta
    -   backdoors
        -   this is more for my framework of things/products than my homepage.
        -   Have a backdoor for a banner across all your webpages, in case if you want to announce anything you just update it in once place and all your outlets that you have on the internet have that message
    -   main map
        -   map everything i have online(public/private) to one place(hops).
        -   there can be a master image that'll always get updated.
        -   also would love to have a proper diagram of the whole thing. suggest starting the diagram by their own section and as things mature we can work on the master diagram.
        -   [seanbreckenridge/HPI: Human Programming Interface](https://github.com/seanbreckenridge/HPI#readme)
    -   when i am gone:
        -   [Cheat Sheet For If I'm Gone](https://thoughtscollected.tech/posts/for-when-im-gone/)
        -   [potatoqualitee/eol-dr: A crowd-sourced guide to help techs help](https://github.com/potatoqualitee/eol-dr)
        -   Have a public blog and a private blog(not the rant sitE), write extreme takes on the private blog. Have a secret key to it, write where to find it in the public and keep that unpublished. add a watchdog timer to publish the steps to get the key. i.e Once I die it'll automatically publish that.
        -   [wilrnh/emergencywalletcards.com](https://github.com/wilrnh/emergencywalletcards.com)
        -   my manual (see below) should have pointers to when i am gone.
-   /metahuman (please change name)
    -   Make a 3D replica of exact me, a page where this is rendered in webgl
    -   physical properties/abilities/kills/like game character, height, weight etc.
    -   keep track of my daily running, and other activities.
    -   [GitHub - brunosimon/my-room-in-3d](https://github.com/brunosimon/my-room-in-3d)
    -   [Anand Sharma on Gyroscope](https://gyrosco.pe/aprilzero/helix/mind/)
    -   [Hackery, Math &amp; Design — Acko.net](https://acko.net/)
-   /thoughts
    -   a place where i can simply post any thought that comes to my mind without having to think "what will someone think?", i tried very hard to get rid of this insecurity but it's hard. So as long as it stays with me, i really need a way where i can just vent however wrong/bad/thoughtcrimey my thoughts are. If i need to correct myself, i need to put it out. My thoughts are NOT me, i need this separation, due to this fear of judgment i am not able to share my thoughts clearly.
    -   It'll be nice to have hashtags/tags where i post these random daily thoughts. org-journal and org-capture would do a great job on my laptop, but i need some mechanism to do it from my phone. Lot of phones occur to me when i am away from my phone and sometimes i would not want to re-write it from my laptop. See [tg-archive](https://github.com/knadh/tg-archive)
-   /interactions
    -   have a section in your blog where people can ask you about your laptop setup. If i know the answer i'll simply answer it, if don't then you get the answer + some amount of bitcoin!
-   /donations
    -   need to have a donations page, donations to orgs and open source projects
-   /photos
    -   take photo, remind me to take a photo everyday.
-   /food
    -   personal food recipes
        -   [balevine/cocktails: Cocktail Recipes](https://github.com/balevine/cocktails)
    -   personal food preferences and places i like
-   /list of list page
    -   /tools
        -   list tools(across different platforms, maybe separated by platform)
        -   also describe how i make use of it/plan to make use of it.
        -   [Steve Blank Startup Tools](https://steveblank.com/tools-and-blogs-for-entrepreneurs/)
        -   [cooltools](https://web.archive.org/web/19970711071555/http://www.cooltool.com/apr96.html) + contab weekly combo
        -   See "Installed Packages Info page generator" on projects.org
        -   [Mystery Knowledge and Useful Tools - Nikhil's blog](https://nikhilism.com/post/2020/mystery-knowledge-useful-tools/)
    -   /links
        -   [About Gwern · Gwern.net](https://www.gwern.net/Links)
        -   [Links | Manas J. Saloi](https://manassaloi.com/links/)
    -   /tils
        -   [hodovani/hodovani.github.io: A collection of personal notes](https://github.com/hodovani/hodovani.github.io)
-   /dateme
    -   a page that would probably help me find a wifu, why throw away chances
-   /other_cool_things
    -   nice to have a random video on my homepage (from my selected set)
    -   if i am available, people can directly chat with me from the site (on voice, video and text)
    -   [GMartigny/gh.midi: 🎵 Create a MIDI file from your Github contributions.](https://github.com/GMartigny/gh.midi)
    -   archival
        -   [Archiving URLs · Gwern.net](https://www.gwern.net/Archiving-URLs)
        -   simply throw it reddit/instagram/twitter urls and it downloads the video on its own etc
        -   [Promnesia | beepb00p](https://beepb00p.xyz/promnesia.html)
        -   [archivy/archivy: Archivy is a self-hostable knowledge](https://github.com/archivy/archivy)


## Social Media {#social-media}

-   [Building a personal website in 2021 | Hacker News](https://news.ycombinator.com/item?id=27173728)  : SM vs building your website
-   [matrix.org · GitHub](https://github.com/matrix-org)
-   [Fraidycat](https://fraidyc.at/)
-   [Micro.blog](https://micro.blog/)
-   [{{index}} - anagora.org](https://anagora.org/index)
-   [Bridgy](https://brid.gy/)
-   twitter
    -   twitter list automation(backups, or maintain elsewhere), tweet deletion, other automation, backup etc
    -   [koenrh/delete-tweets: Delete tweets from your timeline.](https://github.com/koenrh/delete-tweets)
    -   [medialab/gazouilloire: Twitter stream + search API grabber](https://github.com/medialab/gazouilloire)


## Blogging {#blogging}

-   Audience
    -   Since I think writing is the best way i can express myself, i need a way for myself to get heard when i want to, therefore i need an audience.
    -   Write slightly different version of the same blogpost initially to gain some traction. Eg. If you write original "How to install a linux", also write slightly abridged version called "How to install linux when you have windows installed" in a slightly different way and content at a different distribution platform like medium. This will not be required once you have significant traffic on your blog.
    -   If you write regularly and write top quality content then you might as well become premium members in other blogging platforms
-   Document and record the entire process of writing a blogpost from idea curation, generation, research and editing.
-   Blog should have support for usual log articles and also custom designed page for special articles. See this [homepage for the idea](https://www.tiger.exposed/project/lore)
-   Blog should have first class support for indieweb things
    -   [IndieWeb](https://indieweb.org/)
    -   [IndieWebify.Me - a guide to getting you on the IndieWeb](https://indiewebify.me/)
    -   Examples: [James Van Dyne](https://jamesvandyne.com/)
-   Full support for RSS
-   i want to express things socially without being on social media[Anand Sharma on Gyroscope](https://gyrosco.pe/aprilzero/helix/mind/)


## Anonymous Blogging {#anonymous-blogging}

-   [Full guide on online anonymity](https://anonymousplanet-ng.org/guide.html)
-   [Blogging as an anon](https://tdarb.org/blog-anonymously/index.html)
-   [Starting a new digital identity | k3tan.com](https://k3tan.com/starting-a-new-digital-identity)
-   [CrowdStrike/travel-laptop](https://github.com/CrowdStrike/travel-laptop)
-   [Get CalyxOS](https://calyxos.org/get/) (explore other options such as libre, graphite etc)


## Inspiration {#inspiration}

-   setup
    -   [How to put yourself online](https://archive.is/KPct0)
    -   [jkup/awesome-personal-blogs](https://github.com/jkup/awesome-personal-blogs)
    -   [captn3m0 (Nemo)](https://github.com/captn3m0) : really like how he has separate pages explaining their security and normal setup.
    -   [Things and Stuff Wiki](https://wiki.thingsandstuff.org/Main_Page) love how applications and practices that they use are organized
-   manual
    -   [mgreenbe(1) - Michael Greenberg](https://mgree.github.io/) : make a geekodour cli, it's manpage should have this.
    -   [Zach Coelius User Manual .95](https://www.linkedin.com/pulse/i-wrote-user-manual-working-me-its-been-amazingly-zach-coelius/)
-   looks and organization
    -   [Aegir.org | Smooth booze](https://aegir.org/words/smoothbooze) : Love it how he has different color schemes and layout based on the page and the handwritten signature on the bottom.
        -   75% width ftw.
        -   i probably just want my blog to be like this
    -   [My coat of arms | Marijn’s site 🍇](https://satyrs.eu/heraldry/) : Want something like this for my site/home but assamese
    -   [dreamcult](https://dreamcult.xyz/)
    -   404 page should play, phone cannot be found ringtone.
    -   [Yamauchi No.10 Family Office](https://y-n10.com/)  jsut wow, also music on toggle change. sound on/off
        -   love the music [welcome. | maya.land](https://maya.land/)
    -   [your friend Joel](https://joelhooks.com/) : love the site header and title
    -   [My Brain - Aengus McMillin](https://aengusmcmillin.com/brain) : Like how he has a changelog for the blog
    -   [Brendan Schlagel](https://www.brendanschlagel.com/) love the anti-library, canon, collaborate page, now,
    -   [Aaron Parecki](https://aaronparecki.com/) : love the stats n who he is
    -   [Slim Lim](https://slim.computer/)
    -   [Design Of This Website · Gwern.net](https://www.gwern.net/Design)
    -   [ariroffe/personal-website: Code for my Pokémon-style personal](https://github.com/ariroffe/personal-website)
    -   [Andy Matuschak](https://andymatuschak.org/) : love the column layout
    -   [Home of Feross Aboukhadijeh » Feross.org](https://feross.org/) : component organization and colors
    -   [muesli (Christian Muehlhaeuser) · GitHub](https://github.com/muesli) : Love their github readme
    -   [abhisheknaiidu/awesome-github-profile-readme](https://github.com/abhisheknaiidu/awesome-github-profile-readme)
    -   [OMGLORD](https://omglord.com/maps) : Love the city maps idea and the way the homepage color changes
    -   [sean](https://sean.fish/#) : idk what i like about this, maybe not a virus thing, just keeping cuz weird
    -   [Kicks Condor](https://www.kickscondor.com) : i am straight but i would kiss this guy
        -   [Site Structure | maya.land](https://maya.land/site-structure/)
        -   [Evergreen notes](https://notes.andymatuschak.org/Evergreen_notes)
    -   [Ryan Singer](https://feltpresence.com/) : love the minimal column formatting
    -   [XXIIVV — home](https://wiki.xxiivv.com/site/home.html) : really like the use of icons and images, a little difficult to navigate
    -   [Bookshelf — Gordon Brander](https://gordonbrander.com/lib) : like their library and pattern pages
-   content
    -   [Essays · Gwern.net](https://www.gwern.net/)  like the categorization
    -   [Feeds – Interdependent Thoughts](https://www.zylstra.org/blog/feeds/)
    -   [Using Hugo to Launch a Gemini Capsule | Brain Baking](https://brainbaking.com/post/2021/04/using-hugo-to-launch-a-gemini-capsule/)
    -   [zerokspot.com](https://zerokspot.com/blogroll/) : blogroll, link to other ppls blogs
    -   [Emmanuel Quartey | Writing](https://www.quartey.com/questions)
        -   questions categorization
        -   public goals diff link, this is similar to my roadmap plan
    -   welcome to the anteroom
        -   <https://www.lileks.com/>
    -   [Guestbook - Henrique Dias (hacdias)](https://hacdias.com/guestbook)
        -   guest book
        -   [Checkins - Henrique Dias (hacdias)](https://hacdias.com/checkins)
        -   [Emojis - Henrique Dias (hacdias)](https://hacdias.com/emojis)
        -   [Colophon - Henrique Dias (hacdias)](https://hacdias.com/colophon)
        -   website connected over tor
    -   mention that my wiki are my working notes and not intended for publ use
    -   learn with me page
    -   [Webring](https://webring.xxiivv.com/)
    -   <https://sphygm.us/> love their notice on homepage, better now page
    -   [Buster Benson | Codex Vitae](https://busterbenson.com/beliefs/) : codex is cool and [life is also cool](https://busterbenson.com/the-life-of/buster/)
    -   [Privacy Statement: Danny Yee's websites](http://danny.oz.au/privacy/) : like the privacy policy and the map in the travelogue
    -   <https://julian.digital/activity/life-logging/>
    -   <https://www.notion.so/matthewsiu/The-Library-149b0c670fc2463bb08c8c0de6e5018b>
    -   <https://nintil.com/categories/links/>
    -   [jes post](https://j3s.sh/thought/my-website-is-one-binary.html) : like mY vAlUeS
    -   [How I Build](https://pketh.org/how-i-build.html)
    -   [Manfred Touron](https://manfred.life/) : love their sections and usage of graphic
    -   [datagubbe.se](https://www.datagubbe.se/) : love their sections which are self written
    -   [The Webb Page](https://webb.page/) : do not really like the webpage but like the webring idea
    -   [Piotr Wozniak - supermemo.guru](https://supermemo.guru/wiki/Piotr_Wozniak) : like the honesty (also linked in SR)
-   Project listing
    -   [Build tools around workflows, not workflows around tools | thesephist.com](https://thesephist.com/posts/tools/)
    -   [Tristan's Site - Tristan Hume](https://thume.ca/) : like how their presents his projects
    -   [It's Nicky Case!](https://ncase.me/)
    -   [Danielle Baskin](https://daniellebaskin.com/) : Love how this guy is presenting his work, what i want to do very closely relates to his work
    -   [Projects - Josh Pigford](https://joshpigford.com/projects) : Again love how he's showing his work, similar vein of work.
    -   [Open Startup - Nomad List](https://nomadlist.com/open)
    -   [Simple Analytics financial and customer happiness metrics](https://simpleanalytics.com/open)
    -   [Stats - Luke's Wild Website](https://www.lkhrs.com/stats/)
        -   **[[<https://roytang.net/page/stats/site/>][Stats:** Website · roytang.net]]
    -   [Open Startup Metrics - Bannerbear](https://www.bannerbear.com/open/)
-   Wiki ideas
    -   Wikis
        -   [A Brief History &amp; Ethos of the Digital Garden](https://maggieappleton.com/garden-history)
        -   [README - swyx's second brain - Obsidian Publish](https://publish.obsidian.md/swyx/README)
        -   a very nice bi-directional wiki: [barnsworthburning](https://barnsworthburning.net/) love the terms(spaces)


## Monie 💸 {#monie}

-   different fund me pages for different causes, be specific about why and how you plan to use the monie
-   [antfu-sponsors/hi: 👋🏼 About my Sponsor Program](https://github.com/antfu-sponsors/hi)
-   [nayafia/microgrants: A list of microgrant programs for your good ideas](https://github.com/nayafia/microgrants)
-   [mezod/awesome-indie: Resources for independent developers to make money](https://github.com/mezod/awesome-indie)
-   [ralphtheninja/open-funding: A guide for researching ways of funding](https://github.com/ralphtheninja/open-funding)
-   [nayafia/lemonade-stand: A handy guide to financial support for oss](https://github.com/nayafia/lemonade-stand)
-   [beeware/paying-the-piper: A project for discussing ways to fund oss](https://github.com/beeware/paying-the-piper)
-   [Grants (all) · Open Grants](https://www.ogrants.org/grants-01-all.html)
-   [jamesmunns/yogslaw: An idea regarding non-commercial open source lic](https://github.com/jamesmunns/yogslaw)
-   [redbean 2.0 release notes](https://justine.lol/redbean2/) like the funding image
-   gh sponsors
-   Patreon if we create content
-   buy me coffee
-   just do good work and people will start noticing
-   gumroad
-   [amazon wishlist Project tip jar](https://amazon.com/hz/wishlist/ls/EE78A23EEGQB)
-   <https://ipaidthemost.com/> : have this into your page, and into your websites. replace ads with this.
